<?php

return [
    'role' => [
        'invalid' => 'Неверная пользовательская роль.',
    ],
    'social' => [
        'provider' => [
            'invalid' => 'Неверный провайдер социальной сети.',
        ],
    ],
    'gender' => [
        'invalid' => 'Неверный пол.',
    ],
    'email' => [
        'alreadyExists' => 'Данный email %s уже зарегистрирован.',
    ],
    'auth' => [
        'register' => [
            'confirm' => [
                'success' => 'На почтовый ящик отправлено письмо для подтверждения регистрации.',
                'email' => [
                    'subject' => 'Подтверждение регистрации',
                ],
            ],
        ],
        'login' => [
            'emailNotVerified' => 'Подтвердите свой email адрес.',
            'success' => 'Аутентификация прошла успешно.',
            'invalidCredentials' => 'Неверные логин или пароль.',
            'invalidToken' => 'Токен авторизации недействителен.'
        ],
        'logout' => [
            'success' => 'Токен инвалидирован.',
            'fail' => 'Не удалось инвалидировать токен.',
        ],
        'password' => [
            'reminder' => [
                'subject' => 'Сброс пароля',
            ],
            'forgot' => [
                'success' => 'На вашу почту %s отправлено письмо с инструкцией по сбросу пароля.',
            ],
            'reset' => [
                'invalidToken' => 'Ссылка для сброса пароля не существует или устарела.',
                'success' => 'Пароль успешно изменен',
            ],
        ],
    ],
    'user' => [
        'notFound' => 'Пользователь не найден.',
    ],
    'password' => [
        'invalid' => 'Неверный пароль',
    ],
    'account' => [
        'email' => [
            'confirm' => [
                'success' => 'E-mail успешно подтвержден',
            ],
        ],
    ],
];
